#include <iostream>
#include <ctime>
using namespace std;
int main() {
	//1. Задан массив A, содержащий 12 целых случайных чисел от - 5 до 5. 
		//Найти сумму элементов массива.
	//const int n = 12;
	//int a[n];
    //int s = 0;
	//srand(time(nullptr));
	//for (int i = 0; i < n; i++) {
		//a[i] = rand() % 11-;
		//cout << a[i] << ' ';
	//}
	//for (int i = 0; i < n; i++) {
		//s = s + a[i];
   // }
	//cout << s;

	//2. Задан массив, который содержит 13 случайных целых чисел от - 12 до 12. 
		//Найти произведение отрицательных элементов массива.

	//const int n = 13;
	//int a[n];
	//int pr = 0;
	//srand(time(nullptr));
	//for (int i = 0; i < n; i++) {
		//a[i] = rand() % 25-12;
		//cout << a[i] << ' ';
	//}
	//for (int i = 0; i < n; i++) {
		//if (a[i] < 0) {
			//pr = pr * a[i];
	//}
	//cout << pr;

	//3. Задан массив, который содержит 11 случайных целых чисел от 0 до 20. 
		//Найти количество элементов массива, которые делятся на 3 или на 5 или на 7.

	//const int n = 11;
	//int a[n];
	//int k = 0;
	//srand(time(nullptr));
	//for (int i = 0; i < n; i++) {
		//a[i] = rand() % 21;
		//cout << a[i] << ' ';
	//}
	//for (int i = 0; i < n; i++) {
		//if (a[i] % 3 == 0 || a[i] % 5 == 0||a[i]%7==0) {
			//k = k + 1;
		//}
		//cout << k;










}